Revit 2024 API
FamilyUtils Members
The FamilyUtils type exposes the following members.
Methods
Name | Description
ConvertFamilyToFaceHostBased
 Converts a family to be face host based.
FamilyCanConvertToFaceHostBased
 Indicates whether the family can be converted to face host based.
GetProfileSymbols
 Gets the profile Family Symbols of the document.
See Also
FamilyUtils Class
Autodesk.Revit.DB Namespace